[{"model": "aran_api.navy", "pk": 1, "fields": {"title": "SSBN", "className": "Arihant class", "image": "navyImages/india-rsquo-s-first-nuclear-submarine-ins-arihant-is-all-set-for-operations1-_3R3bdil.jpg", "type": "Ballistic missile submarine (SSBN)", "shipName": "INS Arihant (S2)", "origin": "India", "displacememt": "6,000 tonnes", "info": "INS Arihant (SSBN 80) (Sanskrit: Vanquisher of Enemies), designated S2 Strategic Strike Nuclear Submarine, is the lead ship of India's Arihant class of nuclear-powered ballistic missile submarines. The 6,000 tonne vessel was built under the Advanced Technology Vessel (ATV) project at the Ship Building Centre in the port city of Visakhapatnam."}}, {"model": "aran_api.navy", "pk": 2, "fields": {"title": "SSK", "className": "Kalvari class", "image": "navyImages/INS_Kalvari_S21_at_sea.jpg", "type": "Attack submarine", "shipName": "INS Kalvari (S21)", "origin": "France, India", "displacememt": "2,000 tonnes", "info": "INS Kalvari (S21) is the first of the six indigenous Scorpène-class submarines currently in service with the Indian Navy. It is a diesel-electric attack submarine which is designed by DCNS (French naval defence and energy company) and was manufactured at Mazagon Dock Limited in Mumbai."}}, {"model": "aran_api.navy", "pk": 3, "fields": {"title": "SSK", "className": "Kalvari class", "image": "navyImages/INS_Khanderi_at_sea.jpg", "type": "Attack submarine", "shipName": "INS Khanderi (S22)", "origin": "France, India", "displacememt": "2,000 tonnes", "info": "INS Khanderi (2017) is the second of the Indian Navy's six Kalvari-class submarines being built in India. It is a diesel-electric attack submarine which was designed by French naval defence and energy company DCNS and manufactured at Mazagon Dock Limited in Mumbai. The submarine inherits its name and pennant number from INS Khanderi (S22) which served in the Navy from 1968–1989, and was named after Maratha King Shivaji Maharaj's island fort of Khanderi."}}, {"model": "aran_api.navy", "pk": 4, "fields": {"title": "SSK", "className": "Kalvari class", "image": "", "type": "Attack submarine", "shipName": "INS Karanj (S23)", "origin": "France, India", "displacememt": "2,000 tonnes", "info": "INS Karanj (2018) is the third submarine of the first batch of six Kalvari-class submarines for the Indian Navy. It is a diesel-electric attack submarine based on the Scorpène class, designed by French naval defence and energy group DCNS and manufactured by Mazagon Dock Limited, an Indian shipyard in Mumbai. The ship was launched on 31 January 2018."}}, {"model": "aran_api.navy", "pk": 5, "fields": {"title": "SSK", "className": "Sindhughosh class", "image": "navyImages/INS_Sindhughosh_S55.jpg", "type": "Attack submarine", "shipName": "INS Sindhughosh (S55)", "origin": "Soviet Union, Russia", "displacememt": "3,076 tonnes", "info": "INS Sindhughosh (S55) is the lead ship of her class of diesel-electric submarines of the Indian Navy. The submarine was commissioned on 30 April 1986 in Riga, Latvia under the command of Commander K C Varghese. The submarine is diesel-powered and has a total of six motors. INS Sindhughosh was the first submarine in Indian Navy to be equipped with the Klub ZM-54E SS-N-27 antiship cruise missiles with a range of 220 kilometres (140 mi). The submarine has a displacement of nearly 3,100 tons when submerged, a maximum diving depth of 300 metres (980 ft), speed of up to 17 knots (31 km/h), and is able to operate solo for 45 days with a crew of 52."}}, {"model": "aran_api.navy", "pk": 6, "fields": {"title": "SSK", "className": "Sindhughosh class", "image": "navyImages/800px-Ae_dq_ins_S62_1.jpg", "type": "Attack submarine", "shipName": "INS Sindhukirti (S61)", "origin": "Soviet Union, Russia", "displacememt": "3,076 tonnes", "info": "INS Sindhukirti (S61) is the seventh Sindhughosh-class diesel-electric submarine of the Indian Navy. She was built at the Admiralty Shipyard and Sevmash in the Soviet Union. Sindukirti was commissioned on 9 December 1989 in the Soviet Union, with Cdr. Ramdas signing her commissioning orders. She underwent a protracted \"medium refit\" from June 2006 until May 2015 at the Hindustan Shipyard at Visakhapatnam. The midlife upgrade was projected to be completed in 3 years but numerous delays postponed the submarine's return. Having spent one third of her life in refit, she finally returned to service on 23 May 2015."}}, {"model": "aran_api.navy", "pk": 7, "fields": {"title": "SSK", "className": "Sindhughosh class", "image": "navyImages/1280px-Ins_S62.jpg", "type": "Attack submarine", "shipName": "INS Sindhuvijay", "origin": "Soviet Union, Russia", "displacememt": "3,076 tonnes", "info": "INS Sindhuvijay (S62) is a Sindhughosh-class diesel-electric submarine of the Indian Navy."}}, {"model": "aran_api.navy", "pk": 8, "fields": {"title": "SSK", "className": "Shishumar class", "image": "navyImages/INS_Shishumar_SSK_class_sub_of_IN_at_Port_of_Duqm_Oman.jpg", "type": "Attack submarine", "shipName": "INS Shishumar (S44)", "origin": "West Germany, India", "displacememt": "1,850 tonnes", "info": "INS Shishumar (S44) is the lead vessel of the Shishumar class of diesel-electric submarines of the Indian Navy. She was commissioned on 22 September 1986 under Commander P M Bhate."}}, {"model": "aran_api.navy", "pk": 9, "fields": {"title": "Aircraft carriers", "className": "Kiev class", "image": "navyImages/vik_2_0.jpg", "type": "Aircraft carrier", "shipName": "INS Vikramaditya", "origin": "Russia", "displacememt": "44,500 tonnes", "info": "INS Vikramaditya (Sanskrit: Vikramaditya, lit. \"Brave as the Sun\"). is a modified Kiev-class aircraft carrier and the flagship of the Indian Navy, which entered into service in 2013.INS Vikramaditya, the floating airfield has an overall length of about 284 meters and a maximum beam of about 60 meters, stretching as much as three football fields put together. Standing about 20 storeys tall from keel to the highest point, the sheer sight of this 44,500 tonne mega structure of steel is awe inspiring. The ship has a total of 22 decks."}}, {"model": "aran_api.navy", "pk": 10, "fields": {"title": "Amphibious Warfare", "className": "Austin class", "image": "navyImages/INS_Jalashwa_departs_Maldives.jpg", "type": "Amphibious transport dock (LPD)", "shipName": "INS Jalashwa (L41)", "origin": "United States", "displacememt": "16,590 tonnes", "info": "Jalashwa features a well deck, which can house up to four LCM-8 mechanised landing craft that can be launched by flooding the well deck and lowering the hinged gate aft of the ship. She also has a flight deck for helicopter operations from which up to six medium helicopters can operate simultaneously. The deck can also be used to operate vertical take-off and landing (VTOL) aircraft like the Sea Harrier, in special circumstances. She is also capable of embarking over 1,000 troops, and is fully equipped with extensive medical facilities including four operation theatres, a 12-bed ward, a laboratory and a dental centre."}}, {"model": "aran_api.navy", "pk": 11, "fields": {"title": "Amphibious Warfare", "className": "Magar class", "image": "navyImages/INS_Magar_being_escorted_by_INS_Sujata.jpg", "type": "Landing ship tank (LST)", "shipName": "INS Magar (L20)", "origin": "India", "displacememt": "5,655 tonnes", "info": "INS Magar is the lead ship of Magar-class amphibious warfare vessels of the Indian Navy. She was built by Garden Reach Shipbuilders and Engineers, Kolkata and was commissioned by Admiral R.H. Tahiliani, Chief of the Naval Staff on 15 July 1987. The ship has a length of 120 metres and a beam of 17.5 metres. The main weapon systems of the ship consist of CRN 91 Guns, chaff launcher (Kavach) and the WM-18A Rocket launcher. The ship also carries four landing craft vehicle personnel (LCVP) onboard, which can be used for the landing of troops."}}, {"model": "aran_api.navy", "pk": 12, "fields": {"title": "Amphibious Warfare", "className": "Shardul class", "image": "navyImages/INS_Shardul_L16_at_Port_Luis_Mauritius.jpg", "type": "Landing ship tank (LST)", "shipName": "INS Shardul (L16)", "origin": "India", "displacememt": "5650 tonnes", "info": "INS Shardul is the lead ship of the Shardul-class amphibious warfare vessels of the Indian Navy. On 3 October 2008, Shardul was affiliated to the 5 Armoured Regiment of the Indian Army in an on-board ceremony, at the Mumbai Naval Base."}}, {"model": "aran_api.navy", "pk": 13, "fields": {"title": "Amphibious Warfare", "className": "Shardul class", "image": "navyImages/INS_Kesari_during_Milan_2018_exercise.jpg", "type": "Landing ship tank (LST)", "shipName": "INS Kesari (L15)", "origin": "India", "displacememt": "5650 tonnes", "info": "INS Kesari is a Shardul-class tank landing ship of the Indian Navy.In March 2014, the ship, under the command of Commander Mahesh Mangipudi, was involved in the hunt for Malaysia Airlines Flight 370 in the Indian Ocean region."}}, {"model": "aran_api.navy", "pk": 14, "fields": {"title": "Amphibious Warfare", "className": "Shardul class", "image": "navyImages/1280px-The_INS_Airavat_sails_out_of_Visakhapatnam_harbour_after_commissioning_bVEplNh.jpg", "type": "Landing ship tank (LST)", "shipName": "INS Airavat (L24)", "origin": "India", "displacememt": "5,650 tonnes", "info": "INS Airavat was built by Garden Reach Shipbuilders & Engineers in Kolkata at Yard 2016.  She began sea trials in July 2008 after completing basin trials in May. She was commissioned at the Eastern Naval Command in Visakhapatnam on 19 May 2009, by the Chief of Naval Staff, Admiral Sureesh Mehta. She is named for the mount of god Indra, the elephant Airavata, as mentioned in the Rigveda."}}, {"model": "aran_api.navy", "pk": 15, "fields": {"title": "Amphibious Warfare", "className": "Kumbhir class", "image": "navyImages/1280px-L-32_L-34_L-21_L-22_LSTs_and_LCUs_beached.jpg", "type": "Landing ship tank (LST)", "shipName": "INS Kumbhir (L22)", "origin": "Poland", "displacememt": "1120 tonnes", "info": "INS Kumbhir is the lead vessel of her class of the amphibious warfare ships of the Indian Navy. Built at the Gdansk Shipyard in Poland, INS Kumbhir was commissioned in November 1986."}}, {"model": "aran_api.navy", "pk": 16, "fields": {"title": "Amphibious Warfare", "className": "Mk. IV LCU", "image": "navyImages/Mk._IV_LCU_L51_at_sea_cropped.jpg", "type": "Landing craft utility (LCU)", "shipName": "INS LCU 51 (L51)", "origin": "India", "displacememt": "830 tonnes", "info": "Mk IV LCU class vessels are follow on class of Mk. III LCU operated by the Indian Navy. The Mk IV LCU can be deployed for maritime roles that require amphibious capabilities."}}, {"model": "aran_api.navy", "pk": 17, "fields": {"title": "Destroyers", "className": "Visakhapatnam class", "image": "navyImages/Visakhapatnam_D66_-_P15B_destroyer_of_Indian_Navy_during_sea_trials.jpg", "type": "Stealth guided missile destroyer", "shipName": "INS Visakhapatnam (D66)", "origin": "India", "displacememt": "7,400 tonnes", "info": "INS Visakhapatnam is the lead ship of the Visakhapatnam-class stealth guided-missile destroyers of the Indian Navy. The ship is expected to be commissioned by the end of 2021."}}, {"model": "aran_api.navy", "pk": 18, "fields": {"title": "Destroyers", "className": "Kolkata class", "image": "navyImages/1280px-201117-N-NC885-1128_cropped.jpg", "type": "Stealth guided missile destroyer", "shipName": "INS Kolkata (D63)", "origin": "India", "displacememt": "7,500 tonnes", "info": "INS Kolkata is the lead ship of the Kolkata-class stealth guided-missile destroyers of the Indian Navy. She was constructed at Mazagon Dock Limited (MDL), and was handed over to the navy on 10 July 2014 after completing her sea trials. The ship was officially commissioned by Prime Minister Narendra Modi in a ceremony held on 16 August 2014."}}, {"model": "aran_api.navy", "pk": 19, "fields": {"title": "Destroyers", "className": "Kolkata class", "image": "navyImages/Commissioning_of_INS_Kochi_06.jpg", "type": "Stealth guided missile destroyer", "shipName": "NS Kochi (D64)", "origin": "India", "displacememt": "7,500 tonnes", "info": "INS Kochi (D64) is the second ship of the Kolkata-class stealth guided-missile destroyers built under the code name Project 15A for the Indian Navy. She was constructed by Mazagon Dock Limited (MDL) in Mumbai. After undergoing extensive sea trials, she was commissioned to Indian Navy service on 30 September 2015."}}, {"model": "aran_api.navy", "pk": 20, "fields": {"title": "Destroyers", "className": "Kolkata class", "image": "navyImages/INS_Chennai_D65_during_an_exercise_in_the_Indian_Ocean_cropped.jpg", "type": "Stealth guided missile destroyer", "shipName": "INS Chennai (D65)", "origin": "India", "displacememt": "7,500 tonnes", "info": "INS Chennai (D65) is the third and last ship of the Kolkata-class stealth guided missile destroyers of the Indian Navy.  She was constructed by the Mazagon Dock Limited (MDL) at Mumbai. On 17 April 2017, INS Chennai was dedicated to the city of Chennai in presence of then Chief Minister of Tamil Nadu, K. Palaniswamy. INS Chennai has on her seal a Bull symbolising the Jallikattu festival celebrated in Tamil Nadu from where the ship associates its heritage."}}, {"model": "aran_api.navy", "pk": 21, "fields": {"title": "Destroyers", "className": "Delhi class", "image": "navyImages/1280px-INS_Delhi-1.jpg", "type": "Guided missile destroyer", "shipName": "INS Delhi (D61)", "origin": "India", "displacememt": "6,200 tonnes", "info": "INS Delhi is the lead ship of her class of guided-missile destroyers of the Indian Navy. She was built at the Mazagon Dock Limited in Mumbai and commissioned on 15 November 1997. This class is among the largest warships to be designed and built in India.  Delhi is the second vessel of the Indian Navy to bear the name. She inherits the mantle from the Leander-class cruiser of the same name, previously HMS Achilles of Battle of the River Plate fame. She had an illustrious career in the Portuguese-Indian War of 1961, during the annexation of Goa, Daman and Diu when she provided naval gunfire support."}}, {"model": "aran_api.navy", "pk": 22, "fields": {"title": "Guided missile destroyer", "className": "Delhi class", "image": "navyImages/IMDEX_2007_Mysore_523759313.jpg", "type": "Guided missile destroyer", "shipName": "INS Mysore (D60)", "origin": "India", "displacememt": "6,200 tonnes", "info": "INS Mysore is a Delhi-class guided-missile destroyer currently in active service with the Indian Navy. She is the successor to INS Mysore that served in the Indian Navy from 1957 to 1985. Her crest features a double-headed eagle (Gandaberunda) from the sigil of the erstwhile House of Wodeyar of Mysuru."}}, {"model": "aran_api.navy", "pk": 23, "fields": {"title": "Destroyers", "className": "Delhi class", "image": "navyImages/INS_Mumbai_off_the_coast_of_Port_Louis_Mauritius.jpg", "type": "Guided missile destroyer", "shipName": "INS Mumbai (D62)", "origin": "India", "displacememt": "6,200 tonnes", "info": "INS Mumbai is the third of the Delhi-class guided-missile destroyers in active service with the Indian Navy.  The ship's crest depicts the gateway entrance to INS Angre (named as such in honour of Admiral Kanhoji Angre). The gateway has a watch tower with three look-out posts and stands against the backdrop of the ramparts of the fort. Two Ghurabs (or Grabs), depicted on either side of the fort, signify the seafaring traditions of the Marathas. INS Mumbai has been the Flagship for various combat operations like Op Parakram and many Humanitarian Assistance and Disaster Relief (HADR) operations."}}, {"model": "aran_api.navy", "pk": 24, "fields": {"title": "Destroyers", "className": "Rajput class", "image": "navyImages/1280px-Rana-081022-N-7730P-008.jpg", "type": "Guided missile destroyer", "shipName": "INS Rana (D52)", "origin": "Soviet Union", "displacememt": "3,950 tonnes", "info": "INS Rana is a Rajput-class destroyer in active service with the Indian Navy. She was commissioned on 28 June 1982. She is a redesigned Soviet Kashin-class guided missile destroyer."}}, {"model": "aran_api.navy", "pk": 25, "fields": {"title": "Destroyers", "className": "Rajput class", "image": "navyImages/INS_Ravir_D54.jpg", "type": "Guided missile destroyer", "shipName": "INS Ranvir (D54)", "origin": "Soviet Union", "displacememt": "3,950 tonnes", "info": "INS Ranvir is the fourth of the five Rajput-class destroyers built for the Indian Navy. Ranvir was commissioned on 28 October 1986."}}, {"model": "aran_api.navy", "pk": 26, "fields": {"title": "Destroyers", "className": "Rajput class", "image": "navyImages/INS_Ranvijay_at_annual_bi-lateral_naval_field_training_exercise.jpg", "type": "Guided missile destroyer", "shipName": "INS Ranvijay (D55)", "origin": "Soviet Union", "displacememt": "3,950 tonnes", "info": "INS Ranvijay is a Rajput-class destroyer in active service with the Indian Navy. Ranvijay was commissioned on 15 Jan 1988. Ranvijay received the best ship of the Eastern Fleet Trophy for the year 2006–07 and 2011–12."}}, {"model": "aran_api.navy", "pk": 27, "fields": {"title": "Frigates", "className": "Shivalik class", "image": "navyImages/1280px-INS_Shivalik_F-47_during_joint_operations_with_U.S._Navy_200720-N-KO930-1027.jpg", "type": "Stealth guided missile frigate", "shipName": "INS Shivalik (F47)", "origin": "India", "displacememt": "6,200 tonnes", "info": "INS Shivalik (F47) is the lead ship of her class of stealth multi-role frigates built for the Indian Navy. She is the first stealth warship built by India. She was built at the Mazagon Dock Limited (MDL) located in Mumbai. Construction of the vessel began in 2001 and was completed by 2009. She underwent sea trials from thereon before being commissioned on 29 April 2010. Shivalik features improved stealth and land attacking features over the preceding Talwar-class frigates. She is also the first Indian navy ship to use the CODOG (COmbined Diesel Or Gas) propulsion system."}}, {"model": "aran_api.navy", "pk": 28, "fields": {"title": "Frigates", "className": "Talwar class", "image": "navyImages/INS_Talwar_F40_entering_the_port_of_Manama_Bahrain.jpg", "type": "Stealth guided missile frigate", "shipName": "INS Talwar (F40)", "origin": "Russia, India", "displacememt": "4,440 tonnes", "info": "INS Talwar (F40) (translated as \"Sword\") is the lead ship of the Talwar-class frigates of the Indian Navy. Its name means \"Sword\" in Hindi (see Talwar). She was built in Russia, and commissioned into the Indian Navy on 18 June 2003. Talwar is a multirole frigate and true to her name, has participated in various operations and exercises since her commissioning, including anti-piracy operations off the coast of Somalia."}}, {"model": "aran_api.navy", "pk": 29, "fields": {"title": "Frigates", "className": "Brahmaputra class", "image": "navyImages/INS_Brahmaputra-1.jpg", "type": "Guided missile frigate", "shipName": "INS Brahmaputra (F31)", "origin": "India", "displacememt": "3,850 tonnes", "info": "INS Brahmaputra (F31) is the lead ship of her class of guided missile frigates of the Indian Navy. She was built at the Garden Reach Shipbuilders and Engineers (GRSE), Kolkata. The design and construction of the ship is entirely Indian, and is a modification of the Godavari class of frigates.  It is fitted with an array of modern sensor suites and matching weapon systems. INS Brahmaputra was commissioned on 14 April 2000 by Captain Pradeep 'Billoo' Chauhan, VSM. This 3,600-tonne ship is 125 metres (410 ft) long and can reach speeds of up to 30 knots (56 km/h; 35 mph). She operates the Westland Sea King helicopter and the MATCH (Multi Role Anti Submarine Torpedo Carrying Helicopter) helicopter, which is an anti-submarine warfare variant of the Chetak helicopter."}}, {"model": "aran_api.navy", "pk": 30, "fields": {"title": "Frigates", "className": "Godavari class", "image": "navyImages/INS_Gomati_with_Seaking_heli_operations.jpg", "type": "Guided missile frigate", "shipName": "INS Gomati (F21)", "origin": "India", "displacememt": "3,850 tonnes", "info": "INS Gomati (F21) is a Godavari-class guided-missile frigate of Indian Navy.The ship was built by Mazagon Dock Ltd in Mumbai and has an indigenous content of 72%. After her mid-life upgrade in 2011, the ship has been fitted with new weapons and sensors, which include the Barak surface-to-air missile system, an Oto Melara 76 mm gun, HUMSA sonar[1] and Advanced Ship Control System for UAVs. On March 28, 2019, an Indian Navy personnel onboard INS Gomati died during weapons firing drills at sea."}}, {"model": "aran_api.navy", "pk": 31, "fields": {"title": "Corvettes", "className": "Kamorta class", "image": "navyImages/INS_Kamorta_P28_during_operation_at_sea.jpg", "type": "Stealth ASW Corvette", "shipName": "INS Kamorta (P28)", "origin": "India", "displacememt": "3,500 tonnes", "info": "INS Kamorta is the first of four anti-submarine Kamorta-class stealth corvettes which has been built for the Indian Navy. It is a significant step towards India's pursuit for self-reliance in indigenous warship building, bringing closer home Indian Navy's quest to be a true Blue-Water Navy with ships and submarines designed and built within the country. She was designed and manufactured by GRSE,  launched on 19 April 2010, as part of Project 28, approved in 2003. It was named after Kamorta island in Andaman and Nicobar, India ."}}, {"model": "aran_api.navy", "pk": 32, "fields": {"title": "Corvettes", "className": "Kamorta class", "image": "navyImages/INS_Kadmatt_of_Indian_Navy_at_Langkawi_Malaysia_to_Participate_in_LIMA-19.jpg", "type": "Stealth ASW Corvette", "shipName": "INS Kadmatt (P29)", "origin": "India", "displacememt": "3,000 tonnes", "info": "INS Kadmatt (P29) is the second of four anti-submarine warfare corvettes built for the Indian Navy by the Garden Reach Shipbuilders and Engineers of Kolkata under Project 28. She was inducted into the Eastern Naval Command of the Indian Navy.  INS Kadmatt has been named after the Kadmat Island of India's Lakshadweep Islands and carries on the legacy of her predecessor INS Kadmatt (P 78), which served the Navy for 24 years from 23 December 1968 to 30 November 1992."}}, {"model": "aran_api.navy", "pk": 33, "fields": {"title": "Corvettes", "className": "Kamorta class", "image": "navyImages/INS_Kiltan_departs_Sihanoukville_Autonomous_Port_port.jpg", "type": "Stealth ASW Corvette", "shipName": "INS Kiltan (P30)", "origin": "India", "displacememt": "3,000 tonnes", "info": "INS Kiltan (P30) is an anti-submarine warfare corvette of the Indian Navy built under Project 28. It is the third of four Kamorta-class corvettes. The ship was built by the Garden Reach Shipbuilders and Engineers (GRSE), Kolkata, launched on 26 March 2013, and commissioned on 16 October 2017. Kiltan represents a leap forward in the Navy's attempts at localisation with as much as 90% of its content drawn from India itself."}}, {"model": "aran_api.navy", "pk": 34, "fields": {"title": "Corvettes", "className": "Kamorta class", "image": "navyImages/INS_Kavaratti_during_sea_trials.jpg", "type": "Stealth ASW Corvette", "shipName": "INS Kavaratti (P31)", "origin": "India", "displacememt": "3,300 tonnes", "info": "INS Kavaratti (P31) is an anti-submarine warfare corvette of the Indian Navy built under Project 28. It is the last of four Kamorta-class corvettes. The ship was built by the Garden Reach Shipbuilders and Engineers, Kolkata, and launched on 19 May 2015. Kavaratti represents a leap forward in the Navy's attempts at indigenisation with as much as 90% of its content drawn from India itself.[8] It was commissioned into the Navy on 22 October 2020 in Visakhapatnam."}}, {"model": "aran_api.navy", "pk": 35, "fields": {"title": "Corvettes", "className": "Kora class", "image": "navyImages/INS_Kora_entering_Trincomalee_Sri_Lanka.jpg", "type": "Guided missile Corvette", "shipName": "INS Kora (P61)", "origin": "India", "displacememt": "1,400 tonnes", "info": "INS Kora is the lead ship of the Kora-Class of 1,350-tonne guided missile Corvettes in active service with the Indian Navy. The vessel was built at Garden Reach Shipbuilders and Engineers (GRSE) and outfitted at Mazagon Dock Limited (MDL).  She is equipped with 3M-24 Anti-Ship Missiles as a primary weapon, with two Strela-2M Anti-Air Missiles as defensive weapons."}}, {"model": "aran_api.navy", "pk": 36, "fields": {"title": "Corvettes", "className": "Khukri class", "image": "navyImages/download.jpg", "type": "Corvettes", "shipName": "INS Khukri (P49)", "origin": "India", "displacememt": "1,350 tonnes", "info": "INS Khukri is the lead vessel of her class of corvettes, currently in service with the Indian Navy. The ship is named after INS Khukri, the only Indian Navy ship ever lost in combat. The previous Khukri was sunk by two homing torpedoes strike by PNS Hangor during the 1971 Indian-Pakistan war. The ship's captain, Mahendra Nath Mulla, who went down with the ship standing on the deck, was awarded the Maha Vir Chakra posthumously."}}, {"model": "aran_api.navy", "pk": 37, "fields": {"title": "Corvettes", "className": "Veer class", "image": "navyImages/INS_Nirbhik.jpg", "type": "Corvette", "shipName": "INS Nishank (K43)", "origin": "India", "displacememt": "455 tonnes", "info": "The Veer-class corvettes of the Indian Navy are a customised Indian variant of the Soviet Tarantul class.[2][3] They form the 22nd Killer Missile Vessel Squadron."}}, {"model": "aran_api.navy", "pk": 38, "fields": {"title": "Corvettes", "className": "Abhay class", "image": "navyImages/Abhay_class_corvette.jpg", "type": "ASW Corvette", "shipName": "INS Abhay (P33)", "origin": "India", "displacememt": "485 tonnes", "info": "INS Abhay (P33) is the lead ship of her class of anti-submarine warfare corvettes, currently in service with the Indian Navy.  Abhay is Sanskrit for fearless. The ship was commissioned on 10 March 1989."}}]